app/views/foods/_assign_form.html.erb

SELECT "foods"."name" FROM "foods" WHERE "foods"."user_type" = $1  [["user_type", "Request"]]
---
      <label for="">Select User to Donate</label>
      <%= f.select(:assigned_user, Food.where(user_type: 'Request').pluck(:name), {}, { class: 'form-control' }) %>