app/views/foods/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
        <strong>User:</strong>
        <%= @food.user.first_name %>