app/controllers/dashboards_controller.rb

  def index
    if current_user.super_admin?
      @foods = Food.all
---
SELECT "foods".* FROM "foods"