app/controllers/foods_controller.rb

  def index
    if current_user.super_admin?
      @foods = Food.all
    else
      @foods = Food.where(user_id: current_user.id)
---
SELECT "foods".* FROM "foods"
SELECT "foods".* FROM "foods" WHERE "foods"."user_id" = $1  [["user_id", 1]]

  def create
    @food = Food.new(food_params)

    respond_to do |format|
      if @food.save
---
INSERT INTO "foods" ("name", "email", "phone", "address", "food_type", "description", "user_type", "number_of_plate", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"

  def update
    respond_to do |format|
      if @food.update(food_params)
---
UPDATE "foods" SET "user_type" = $1, "updated_at" = $2 WHERE "foods"."id" = $3  [["user_type", "Request"], ["updated_at", "2021-01-17 08:24:27.688351"], ["id", 2]]

  def destroy
    @food.destroy
---
DELETE FROM "foods" WHERE "foods"."id" = $1  [["id", 2]]

  def assign
    @food = Food.find(params[:id].to_i)
---
SELECT "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def assign_food
    if food_params[:assigned_user].present?
      @food = Food.find(food_params[:id].to_i)
      if @food.present?
        @food.status = true
        @food.assigned_user = food_params[:assigned_user]
        @food.save
        @food_req_user = Food.where(name: food_params[:assigned_user]).first
        @food_req_user.status = true
        @food_req_user.assigned_user = @food.name
        @food_req_user.save
---
SELECT "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "foods" SET "assigned_user" = $1, "updated_at" = $2 WHERE "foods"."id" = $3  [["assigned_user", nil], ["updated_at", "2021-01-17 08:54:46.773303"], ["id", 1]]
SELECT "foods".* FROM "foods" WHERE "foods"."name" = $1 ORDER BY "foods"."id" ASC LIMIT $2  [["name", "req"], ["LIMIT", 1]]
UPDATE "foods" SET "status" = $1, "assigned_user" = $2, "updated_at" = $3 WHERE "foods"."id" = $4  [["status", true], ["assigned_user", "Nithin"], ["updated_at", "2021-01-17 08:53:08.141466"], ["id", 2]]